2020/fall/week-03/bullet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points(19);
        points[0]  = point(0.75, 0, -0.5);
        points[1] = point(1, 0, -0.5);
        points[2] = point(1, 0.25, -0.5);
        points[3] = point(0.75, 0.25, -0.5);
        points[4] = point(0.75, 0.5, -0.5);
        points[5] = point(1, 0.5, -0.5);
        points[6] = point(1, 1, -0.5);
        points[7] = point(0.75, 1, -0.5);
        points[8] = point(0.5, 1, -0.5);
        points[9] = point(0.6, 0.5, -0.5);
        points[10] = point(0.6, 0.25, -0.5);
        points[11] = point(0.55, 0.2, -0.5);
        points[12] = point(0.45, 0.4, -0.5);
        points[13] = point(0.45, 1, -0.5);
        points[14] = point(0, 1, -0.5);
        points[15] = point(0, 0.4, -0.5);
        points[16] = point(0, 0, -0.5);
        points[17] = point(0.25, 0, -0.5);
        points[18] = point(0.5, 0, -0.5);


        // Duplicate z points
        label sz = points.size();
        points.setSize(2*sz);
        for (label i = 0; i < sz; i++)
        {
            const point& pt = points[i];
            points[i+sz] = point(pt.x(), pt.y(), -pt.z());
        }

        os  << points;
    #};
};


blocks
(
    hex (0 1 2 3 19 20 21 22) (10 10 1) simpleGrading (1 1 1) // 0
    hex (3 2 5 4 22 21 24 23) (10 10 1) simpleGrading (1 1 1) // 1
    hex (4 5 6 7 23 24 25 26) (10 10 1) simpleGrading (1 1 1) // 2
    hex (9 4 7 8 28 23 26 27) (10 10 1) simpleGrading (1 1 1) // 3
    hex (10 3 4 9 29 22 23 28) (10 10 1) simpleGrading (1 1 1) // 4
    hex (11 10 9 12 30 29 28 31) (10 10 1) simpleGrading (1 1 1) // 5
    hex (17 18 11 12 36 37 30 31) (10 10 1) simpleGrading (1 1 1) // 6
    hex (16 17 12 15 35 36 31 34) (10 10 1) simpleGrading (1 1 1) // 7
    hex (15 12 13 14 34 31 32 33) (10 10 1) simpleGrading (1 1 1) // 8
    hex (12 9 8 13 31 28 27 32) (10 10 1) simpleGrading (1 1 1) // 9
);

edges
(
 //   arc 0 5 (0.469846 0.17101 -0.5)
 //   arc 5 10 (0.17101 0.469846 -0.5)
 //   arc 1 4 (0.939693 0.34202 -0.5)
 //   arc 4 9 (0.34202 0.939693 -0.5)
 //   arc 19 24 (0.469846 0.17101 0.5)
 //   arc 24 29 (0.17101 0.469846 0.5)
 //   arc 20 23 (0.939693 0.34202 0.5)
 //   arc 23 28 (0.34202 0.939693 0.5)
 //   arc 11 16 (-0.469846 0.17101 -0.5)
 //   arc 16 10 (-0.17101 0.469846 -0.5)
 //   arc 12 15 (-0.939693 0.34202 -0.5)
 //   arc 15 9 (-0.34202 0.939693 -0.5)
 //   arc 30 35 (-0.469846 0.17101 0.5)
 //   arc 35 29 (-0.17101 0.469846 0.5)
 //   arc 31 34 (-0.939693 0.34202 0.5)
 //   arc 34 28 (-0.34202 0.939693 0.5)
);

boundary
(
    inlet 
    {
        type patch;
        faces
        (
            (35 34 15 16)
            (15 34 33 14)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 21 20)
            (2 5 24 21)
            (6 5 24 25)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (14 13 32 33)
            (13 8 27 32)
            (8 7 27 26)
            (7 6 26 25)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (16 35 36 17)
            (17 36 37 18)
            (0 1 20 19)
        );
    }

    // front and back
    empty
    {
        type empty;
        faces
        (
            (22 21 20 19)
            (23 24 22 21)
            (26 25 24 23)
            (27 26 23 28)
            (28 23 22 29)
            (31 28 29 30)
            (36 31 30 37)
            (35 34 31 36)
            (33 34 32 31)
            (32 27 28 31)
            (0 1 2 3)
            (2 3 4 5)
            (4 5 6 7)
            (8 7 9 4)
            (10 9 4 3)
            (12 9 10 11)
            (17 12 11 18)
            (15 12 17 16)
            (14 13 12 15)
            (13 8 9 12)
        );
    }

    wall
    {
        type patch;
        faces
        (
            (18 11 30 37)
            (11 10 29 30)
            (10 3 22 29)
            (0 3 22 19)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //